In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = np.arange(12.).reshape((3,4))

In [3]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [5]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [12]:
series =frame.iloc[0]

In [13]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [10]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [11]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [14]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [19]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [20]:
series2

b    0
e    1
f    2
dtype: int64

In [22]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [23]:
series3 = frame['d']

In [25]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [28]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [49]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [50]:
frame

               b         d         e
Utah   -0.123152 -2.044323  0.815811
Ohio    1.113296  0.235751 -1.525211
Texas   1.915217 -1.331036  0.046200
Oregon  0.315406  0.768984  1.627487

In [51]:
np.abs(frame)

               b         d         e
Utah    0.123152  2.044323  0.815811
Ohio    1.113296  0.235751  1.525211
Texas   1.915217  1.331036  0.046200
Oregon  0.315406  0.768984  1.627487

In [52]:
frame.apply(lambda x: x.max() - x.min(), axis=1)

Utah      2.860135
Ohio      2.638507
Texas     3.246254
Oregon    1.312080
dtype: float64

In [53]:
states = ['Texas', 'Utah', 'California']

In [55]:
# frame.reindex(index=['a', 'b', 'c', 'd', 'e'], method='ffill').reindex(columns=states)